# Creating Pandas dataframes

In [1]:
import pandas as pd

In [2]:
names = [
    ['Paul','Boal','E'],
    ['Eric','Westhus','D'],
    ['Bill','Jones','A']
    ]

In [4]:
pd.DataFrame(names)

      0        1  2
0  Paul     Boal  E
1  Eric  Westhus  D
2  Bill    Jones  A

In [4]:
pd.DataFrame(names, columns=['first','last','middle'])

  first     last middle
0  Paul     Boal      E
1  Eric  Westhus      D
2  Bill    Jones      A

In [5]:
data = pd.DataFrame(names, columns=['first','last','middle'])

In [6]:
data['first']

0    Paul
1    Eric
2    Bill
Name: first, dtype: object

In [7]:
data.size

9

In [8]:
first_names = ['Paul','Eric','Bill']
middle_names = ['E','D','A']
last_names = ['Boal','Westhus','Jones']

In [9]:
list(zip(first_names, middle_names, last_names))

[('Paul', 'E', 'Boal'), ('Eric', 'D', 'Westhus'), ('Bill', 'A', 'Jones')]

In [10]:
pd.DataFrame(list(zip(first_names, middle_names, last_names)), columns=['first','middle','last'])

  first middle     last
0  Paul      E     Boal
1  Eric      D  Westhus
2  Bill      A    Jones

In [13]:
people = [
    { 'first': 'Paul', 'last': 'Boal', 'middle': 'E' },
    { 'first': 'Eric', 'last': 'Westhus', 'middle': 'D'},
    { 'first': 'Bill', 'last': 'Jones', 'middle': 'A'}
]

In [14]:
pd.DataFrame(people)

  first     last middle
0  Paul     Boal      E
1  Eric  Westhus      D
2  Bill    Jones      A

In [9]:
people = [
    { 'first': 'Paul', 'last': 'Boal', 'middle': 'E' },
    { 'first': 'Eric', 'last': 'Westhus', 'middle': 'D'},
    {  'last': 'Jones', 'first': 'Bill'}
]

In [10]:
pd.DataFrame(people)

  first     last middle
0  Paul     Boal      E
1  Eric  Westhus      D
2  Bill    Jones    NaN

In [2]:
import pandas as pd
people = [
    { 'first': 'Paul', 'last': 'Boal', 'middle': 'E' },
    { 'first': 'Eric', 'last': 'Westhus', 'middle': 'D'},
    { 'first': 'Bill', 'last': 'Jones', 'middle': 'A'},
    { 'first': 'Walter', 'last': 'Cronkite'},
    { 'first': 'Eddie', 'last': 'Murphy'},
    { 'first': 'Cher'}
]
pd.DataFrame(people)

    first      last middle
0    Paul      Boal      E
1    Eric   Westhus      D
2    Bill     Jones      A
3  Walter  Cronkite    NaN
4   Eddie    Murphy    NaN
5    Cher       NaN    NaN

In [11]:
visits = pd.read_csv('/data/visits.csv')

In [12]:
visits

,SYSTEM,HOSPITAL,PATIENT_ID,PATIENT_AGE,BILLING_CODE,SERVICE_CODE,VISIT_DATE
0,Mercy,Missouri Baptist,E74109,39,97140,12,2021-05-01
1,BJC,SSM DePaul,E29207,40,97140,11,2021-03-25
2,SSM,SLU Hospital,E37839,33,G0283,11,2021-07-25
3,SSM,Mercy St. Louis,E45853,65,G0283,12,2021-07-27
4,SSM,SLU Hospital,E14769,48,97140,12,2021-06-16
...,...,...,...,...,...,...,...
195,SSM,Missouri Baptist,E61327,52,97140,12,2021-08-09
196,SSM,SLU Hospital,E13076,42,97140,12,2021-01-07
197,Mercy,Barnes Jewish,E72890,36,97140,12,2021-08-15
198,Mercy,SSM DePaul,E82016,66,97140,11,2021-07-04
199,SSM,SSM DePaul,E26182,36,G0283,12,2021-06-15

In [13]:
len(visits)

200

In [14]:
visits.shape

(200, 7)

In [16]:
visits['PATIENT_AGE'].mean()

52.125

In [17]:
visits.dtypes

SYSTEM          object
HOSPITAL        object
PATIENT_ID      object
PATIENT_AGE      int64
BILLING_CODE    object
SERVICE_CODE     int64
VISIT_DATE      object
dtype: object

In [18]:
pd.read_json('/data/negotiated_rates.json')

,reporting_entity_name,reporting_entity_type,last_updated_on,version,out_of_network
0,"United HealthCare Services, Inc.",Third-Party Administrator,2022-10-01,1.0.0,{'name': 'E-STIM 1/> AREAS OTH THAN WND CARE P...
1,"United HealthCare Services, Inc.",Third-Party Administrator,2022-10-01,1.0.0,{'name': 'MANUAL THERAPY TQS 1/> REGIONS EACH ...
2,"United HealthCare Services, Inc.",Third-Party Administrator,2022-10-01,1.0.0,"{'name': 'SBSQ HOSPITAL CARE/DAY 25 MINUTES', ..."
3,"United HealthCare Services, Inc.",Third-Party Administrator,2022-10-01,1.0.0,"{'name': 'SBSQ HOSPITAL CARE/DAY 35 MINUTES', ..."
4,"United HealthCare Services, Inc.",Third-Party Administrator,2022-10-01,1.0.0,{'name': 'THER PX 1/> AREAS EACH 15 MIN NEUROM...
5,"United HealthCare Services, Inc.",Third-Party Administrator,2022-10-01,1.0.0,{'name': 'THERAPEUTIC PX 1/> AREAS EACH 15 MIN...

In [19]:
dfs = pd.read_html('https://en.wikipedia.org/wiki/List_of_cities_proper_by_population_density')

In [20]:
len(dfs)

3

In [21]:
dfs[0]

                                            Ekistics
0  List of largest cities List of cities proper b...
1                                      Cities portal
2  .mw-parser-output .navbar{display:inline;font-...

In [22]:
dfs[1]

    0                                                  1
0 NaN  This list is incomplete; you can help by addin...

In [24]:
dfs[2]

                 City Population Area      Density                Country  \
                 City Population  km2 sqmi    /km2   /sqmi        Country
0              Manila    1846513   43   17   43062  111532  Philippines *
1         Mandaluyong     425758   11    4   38495   99703  Philippines *
2             Pateros      65227    2    1   37061   95988  Philippines *
3            Caloocan    1661584   53   21   31233   80893  Philippines *
4           Bnei Brak     212646    7    3   30001   77702       Israel *
..                ...        ...  ...  ...     ...     ...            ...
69              Cairo    9539673  606  234   15742   40772        Egypt *
70    Rosario, Cavite     110807    8    3   14561   37712  Philippines *
71            Mandaue     364116   25   10   14461   37453  Philippines *
72             Bacoor     664625   46   18   14395   37284  Philippines *
73  San Pedro, Laguna     326001   24    9   13555   35108  Philippines *

                 Year
                 Year
0    2020 [1] 2018[2]
1         2020 [1][3]
2    2020 [1] 2013[3]
3         2020 [1][3]
4         2022 [4][5]
..                ...
69  2019[59] 2017[60]
70  2020 [1] 2013[39]
71  2020 [1] 2013[39]
72  2020 [1] 2013[39]
73  2020 [1] 2013[39]

[74 rows x 8 columns]